In [20]:
import pandas as pd
import numpy as np

In [3]:
data1 = {'Location':['PUNE','MYS','HYDB','MYS','PUNE','MYS'],
        'Person':['Ram','Harish','Anand','Sudha','Sumegha','Melvin'],
        'Sales':[1200,1140,1340,1124,2143,1350]}
data1

{'Location': ['PUNE', 'MYS', 'HYDB', 'MYS', 'PUNE', 'MYS'],
 'Person': ['Ram', 'Harish', 'Anand', 'Sudha', 'Sumegha', 'Melvin'],
 'Sales': [1200, 1140, 1340, 1124, 2143, 1350]}

In [5]:
df=pd.DataFrame(data1)
df

  Location   Person  Sales
0     PUNE      Ram   1200
1      MYS   Harish   1140
2     HYDB    Anand   1340
3      MYS    Sudha   1124
4     PUNE  Sumegha   2143
5      MYS   Melvin   1350

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Location  6 non-null      object
 1   Person    6 non-null      object
 2   Sales     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [7]:
df.groupby('Location')

In [8]:
pd.DataFrame(df.groupby('Location'))

      0                                                  1
0  HYDB    Location Person  Sales
2     HYDB  Anand   1340
1   MYS    Location  Person  Sales
1      MYS  Harish  ...
2  PUNE    Location   Person  Sales
0     PUNE      Ram...

In [9]:
df.groupby(['Location','Person'])

In [10]:
pd.DataFrame(df.groupby(['Location','Person']))

                 0                                                  1
0    (HYDB, Anand)    Location Person  Sales
2     HYDB  Anand   1340
1    (MYS, Harish)    Location  Person  Sales
1      MYS  Harish  ...
2    (MYS, Melvin)    Location  Person  Sales
5      MYS  Melvin  ...
3     (MYS, Sudha)    Location Person  Sales
3      MYS  Sudha   1124
4      (PUNE, Ram)    Location Person  Sales
0     PUNE    Ram   1200
5  (PUNE, Sumegha)    Location   Person  Sales
4     PUNE  Sumegha...

In [11]:
df.drop('Person',axis=1,inplace=True)

In [12]:
df

  Location  Sales
0     PUNE   1200
1      MYS   1140
2     HYDB   1340
3      MYS   1124
4     PUNE   2143
5      MYS   1350

In [14]:
by_location=df.groupby('Location')
by_location

In [15]:
by_location.mean()

                Sales
Location
HYDB      1340.000000
MYS       1204.666667
PUNE      1671.500000

In [16]:
by_location.std()

               Sales
Location
HYDB             NaN
MYS       126.116348
PUNE      666.801695

In [21]:
df.groupby('Location').agg([np.mean,np.median])

                Sales
                 mean  median
Location
HYDB      1340.000000  1340.0
MYS       1204.666667  1140.0
PUNE      1671.500000  1671.5